Ruby on Rails/Hire & Job App/hire_job/app/controllers/companies_controller.rb

  def create

    @company = current_user.build_company(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Minha Companhia"], ["url", "https://minhacompanhia.com.br"], ["user_id", 13], ["created_at", "2022-06-08 02:44:34.279418"], ["updated_at", "2022-06-08 02:44:34.279418"]]
UPDATE "companies" SET "updated_at" = $1 WHERE "companies"."id" = $2  [["updated_at", "2022-06-08 02:44:34.364949"], ["id", 3]]

  def update

    @company = current_user.company
    if @company.update(company_params)
---
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "Ana Store 3"], ["updated_at", "2022-06-08 04:55:47.645965"], ["id", 4]]